SELECT
    case when "Фамилия" <> 'Не определено' then "Фамилия" else '' end AS "Фамилия", 
    case when "Имя" <> 'Не определено' then "Имя" else '' end AS "Имя",
    case when "Отчество" <> 'Не определено' then "Отчество" else '' end AS "Отчество",
    "Дата рождения",
	"Код подразделения МУ" as "Код подразделения"
FROM
    "Миграционный учет"."Миграционный учет"
where
    "Дата создания дела" >= date '2024-09-18' 
    and "Дата создания дела" <= date '2024-09-18'
    and "Код региона" IN ('74')
    and "Регион РФ (по подразделению создания дела)" IN ('Челябинская область')
    and "Тип дела" in ('Постановка ИГ на учет по месту пребывания', 'Постановка ИГ на учет по месту пребывания (организации)', 'Регистрация ИГ по месту жительства')
	and "Категория поставщика дела" NOT IN ('ФСИН','ГУФСИН')
	and "Отметка проставлена" NOT IN ('ФСИН','ГУФСИН')
	and LOWER("ФИО Принимающей стороны") NOT LIKE '%сизо-%'
	and LOWER("ФИО Принимающей стороны") NOT LIKE '%изоля%'

-- araider@mvd.ru
-- oivanova186@mvd.ru
-- mivanova73@mvd.ru
-- enazmutdinova3@mvd.ruь