SELECT
    SUBSTR("ФИО", 1, INSTR("ФИО", ' ') - 1) AS "Фамилия",
    SUBSTR("ФИО", INSTR("ФИО", ' ') + 1, INSTR("ФИО", ' ', 1, 2) - INSTR("ФИО", ' ') - 1) AS "Имя",
    SUBSTR("ФИО", INSTR("ФИО", ' ', 1, 2) + 1) AS "Отчество",
    "Дата рождения",
	"Код подразделения"
FROM
    "Регистрационный учет"."Регистрационный учет"
where
    "Дата создания дела" >= date '2024-09-18' 
    and "Дата создания дела" <= date '2024-09-18'
    and "Код региона (по подразделению создания дела)" IN ('74')
    and "Регион РФ (по подразделению создания дела)" IN ('Челябинская область')
    and lower("Тип дела") LIKE '%постановка%'





